import {Post} from '../model/Post';

export class TestData {
  static posts: Post[] = [
    {
      id: 1,
      content: 'Исследование посвящено политическим и социальным процессам эпохи становления и развития капитализма. Поланьи утверждает, что рыночную экономику и национальное государство следует рассматривать не по отдельности, а как единое явление — общество рынка или рыночное общество. Его возникновение разрушило традиционный социальный порядок — на протяжении большей части истории человечества экономическая деятельность не отделялась от социальных отношений, автор подчёркивал грандиозность перемен. Новый институциональный уклад породил контртенденции, которые привели к катаклизмам XX века. Согласно Поланьи, утопическая идея саморегулирующегося рынка не вытекала из природы человека или социального развития, а возникла в конкретных исторических обстоятельствах начала XIX века, в попытке объяснить социальные бедствия промышленной революции.',
      date: new Date('2019-04-10'),
      author: {
        nikName: '@koljn999',
        firstName: 'Николай',
        lastName: 'Пятаев'
      }
    },
    {
      id: 2,
      content: 'Исследование посвящено политическим и социальным процессам эпохи становления и развития капитализма. Поланьи утверждает, что рыночную экономику и национальное государство следует рассматривать не по отдельности, а как единое явление — общество рынка или рыночное общество. Его возникновение разрушило традиционный социальный порядок — на протяжении большей части истории человечества экономическая деятельность не отделялась от социальных отношений, автор подчёркивал грандиозность перемен. Новый институциональный уклад породил контртенденции, которые привели к катаклизмам XX века. Согласно Поланьи, утопическая идея саморегулирующегося рынка не вытекала из природы человека или социального развития, а возникла в конкретных исторических обстоятельствах начала XIX века, в попытке объяснить социальные бедствия промышленной революции.',
      date: new Date('2019-05-10'),
      author: {
        nikName: '@lexa',
        firstName: 'Алексей',
        lastName: 'Пятаев'
      }
    },
    {
      id: 3,
      content: 'Исследование посвящено политическим и социальным процессам эпохи становления и развития капитализма. Поланьи утверждает, что рыночную экономику и национальное государство следует рассматривать не по отдельности, а как единое явление — общество рынка или рыночное общество. Его возникновение разрушило традиционный социальный порядок — на протяжении большей части истории человечества экономическая деятельность не отделялась от социальных отношений, автор подчёркивал грандиозность перемен. Новый институциональный уклад породил контртенденции, которые привели к катаклизмам XX века. Согласно Поланьи, утопическая идея саморегулирующегося рынка не вытекала из природы человека или социального развития, а возникла в конкретных исторических обстоятельствах начала XIX века, в попытке объяснить социальные бедствия промышленной революции.',
      date: new Date('2019-08-11'),
      author: {
        nikName: '@lexa',
        firstName: 'Алексей',
        lastName: 'Пятаев'
      }
    },
    {
      id: 4,
      content: 'Исследование посвящено политическим и социальным процессам эпохи становления и развития капитализма. Поланьи утверждает, что рыночную экономику и национальное государство следует рассматривать не по отдельности, а как единое явление — общество рынка или рыночное общество. Его возникновение разрушило традиционный социальный порядок — на протяжении большей части истории человечества экономическая деятельность не отделялась от социальных отношений, автор подчёркивал грандиозность перемен. Новый институциональный уклад породил контртенденции, которые привели к катаклизмам XX века. Согласно Поланьи, утопическая идея саморегулирующегося рынка не вытекала из природы человека или социального развития, а возникла в конкретных исторических обстоятельствах начала XIX века, в попытке объяснить социальные бедствия промышленной революции.',
      date: new Date('2019-04-12'),
      author: {
        nikName: '@koljn999',
        firstName: 'Николай',
        lastName: 'Пятаев'
      }
    },
    {
      id: 5,
      content: 'Исследование посвящено политическим и социальным процессам эпохи становления и развития капитализма. Поланьи утверждает, что рыночную экономику и национальное государство следует рассматривать не по отдельности, а как единое явление — общество рынка или рыночное общество. Его возникновение разрушило традиционный социальный порядок — на протяжении большей части истории человечества экономическая деятельность не отделялась от социальных отношений, автор подчёркивал грандиозность перемен. Новый институциональный уклад породил контртенденции, которые привели к катаклизмам XX века. Согласно Поланьи, утопическая идея саморегулирующегося рынка не вытекала из природы человека или социального развития, а возникла в конкретных исторических обстоятельствах начала XIX века, в попытке объяснить социальные бедствия промышленной революции.',
      date: new Date('2020-01-01'),
      author: {
        nikName: '@katj',
        firstName: 'Екатерина',
        lastName: 'Пятаева'
      }
    }
  ];
}
